       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGROMAN.
       AUTHOR. GENEVIEVE GIANNASI.
       INSTALLATION. PERSONAL COMPUTER.
       DATE-WRITTEN. 06-02-2024.
       DATE-COMPILED. 06-02-2024.
       SECURITY. NON-CONFIDENTIAL.
       
      ******************************************************************
      * OBJECTIF: Convertir un chiffre arabe en romain, ici max 1000000
      *    Milliers, de 1000 à 4000	: M MM MMM MMMM
      *    Centaines, de 100 à 900	: C CC CCC CD D DC DCC DCCC CM
      *    Dizaines, de 10 à 90     : X XX XXX XL L LX LXX LXXX XC
      *    Unités, de 1 à 9         : I II III IV V VI VII VIII IX
      *  Liste des nombres romains de 1000 à 1 million:
      *    https://mammothmemory.net/maths/numbers/roman-numerals/roman-
      *    numerals-from-1000-to-1-million.html
      ******************************************************************
       
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
           ALPHABET ASCII-SEQUENCE IS STANDARD-2.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *
      ****** ZONE POUR ACCEPTER DE CONTINUER OU NON D'EXECUTER LE PROGRAMME
       01  WS-REPONSE    PIC X(01).      
           88  WS-REPONSE-Y  VALUE "Y".
           88  WS-REPONSE-N  VALUE "N".
      *
      ****** ZONES DE SAISIE DU NOMBRE ARABE 
       01  WS-ACCEPTE    PIC X(07) VALUE SPACES.
      *
      ******* ZONE DES NOMBRES ARABE ET ROMAIN
       01  WS-NBR.
           05 WS-NBR-ROMAN  PIC X(25) VALUE SPACES.
           05 WS-NBR-ARABIC PIC 9(07) VALUE ZEROES.
      *
      ******* ZONE DE CALCUL DU NOMBRE ARABE
       01  WS-CALC-ARABIC   PIC 9(07) VALUE ZEROES.
       01  WS-INTER-ARABIC  PIC 9(07) VALUE ZEROES.
      *
      ****** ZONE POUR STOCKER LES CARACTERES ROMAINS A LA SUITE
       01  WS-INTER-ROMAN   PIC X(25) VALUE SPACES.
      *
      ****** ZONE D'AFFICHAGE DU RESULTAT
       01  WS-AFFICHAGE     PIC X(70) VALUE SPACES.
      *
      ****** ZONES POUR TRAITER UNE BOUCLE AVEC UN INDICE INCREMENTAL
       01  WS-BOUCLE PIC X(01).
           88  WS-BOUCLE-EOF  VALUE "Y".
           88  WS-BOUCLE-NEOF VALUE "N".
      ****** L'INDICE PERMET DE SE POSITIONNER SUR LA COLONNE DU 
      ****** CHIFFRE ARABE SAISI (COLONNE DE 1 A 7):
      ****** COL 1 : MILION
      ****** COL 2 : CENTAINE DE MILLIER
      ****** COL 3 : DIZAINE DE MILIER
      ****** COL 4 : MILLIER
      ****** COL 5 : CENTAINE
      ****** COL 6 : DIZAINE
      ****** COL 7 : UNITE
       01  I      PIC 9(07) VALUE ZEROES.

      *****************************************
      *  TABLE DES CARACTERES ARABES ET ROMANS
      *****************************************
       01  WS-TABLEAU.
           05 WS-OCCURS.
              10 FILLER PIC X(19) VALUE "0000001 I".
              10 FILLER PIC X(19) VALUE "0000002 II".
              10 FILLER PIC X(19) VALUE "0000003 III".
              10 FILLER PIC X(19) VALUE "0000004 IV".
              10 FILLER PIC X(19) VALUE "0000005 V".
              10 FILLER PIC X(19) VALUE "0000006 VI".
              10 FILLER PIC X(19) VALUE "0000007 VII".
              10 FILLER PIC X(19) VALUE "0000008 VIII".
              10 FILLER PIC X(19) VALUE "0000009 IX".
              10 FILLER PIC X(19) VALUE "0000010 X".
              10 FILLER PIC X(19) VALUE "0000020 XX".
              10 FILLER PIC X(19) VALUE "0000030 XXX".
              10 FILLER PIC X(19) VALUE "0000040 XL".
              10 FILLER PIC X(19) VALUE "0000050 L".
              10 FILLER PIC X(19) VALUE "0000060 LX".
              10 FILLER PIC X(19) VALUE "0000070 LXX".
              10 FILLER PIC X(19) VALUE "0000080 LXXX".
              10 FILLER PIC X(19) VALUE "0000090 XC".
              10 FILLER PIC X(19) VALUE "0000100 C".
              10 FILLER PIC X(19) VALUE "0000200 CC".
              10 FILLER PIC X(19) VALUE "0000300 CCC".
              10 FILLER PIC X(19) VALUE "0000400 CD".
              10 FILLER PIC X(19) VALUE "0000500 D".
              10 FILLER PIC X(19) VALUE "0000600 DC".
              10 FILLER PIC X(19) VALUE "0000700 DCC".
              10 FILLER PIC X(19) VALUE "0000800 DCCC".
              10 FILLER PIC X(19) VALUE "0000900 CM".
              10 FILLER PIC X(19) VALUE "0001000 M".
              10 FILLER PIC X(19) VALUE "0002000 MM".
              10 FILLER PIC X(19) VALUE "0003000 MMM".
              10 FILLER PIC X(19) VALUE "0004000 MV".
              10 FILLER PIC X(19) VALUE "0005000 V".
              10 FILLER PIC X(19) VALUE "0006000 VM".
              10 FILLER PIC X(19) VALUE "0007000 VMM".
              10 FILLER PIC X(19) VALUE "0008000 VMMM".
              10 FILLER PIC X(19) VALUE "0009000 MX".
              10 FILLER PIC X(19) VALUE "0010000 X".
              10 FILLER PIC X(19) VALUE "0011000 XI".
              10 FILLER PIC X(19) VALUE "0012000 XII".
              10 FILLER PIC X(19) VALUE "0013000 XIII".
              10 FILLER PIC X(19) VALUE "0014000 XIV".
              10 FILLER PIC X(19) VALUE "0015000 XV".
              10 FILLER PIC X(19) VALUE "0016000 XVI".
              10 FILLER PIC X(19) VALUE "0017000 XVII".
              10 FILLER PIC X(19) VALUE "0018000 XVIII".
              10 FILLER PIC X(19) VALUE "0019000 XIX".
              10 FILLER PIC X(19) VALUE "0020000 XX".
              10 FILLER PIC X(19) VALUE "0021000 XXI".
              10 FILLER PIC X(19) VALUE "0022000 XXII".
              10 FILLER PIC X(19) VALUE "0023000 XXIII".
              10 FILLER PIC X(19) VALUE "0024000 XXIV".
              10 FILLER PIC X(19) VALUE "0025000 XXV".
              10 FILLER PIC X(19) VALUE "0026000 XXVI".
              10 FILLER PIC X(19) VALUE "0027000 XXVII".
              10 FILLER PIC X(19) VALUE "0028000 XXVIII".
              10 FILLER PIC X(19) VALUE "0029000 XXIX".
              10 FILLER PIC X(19) VALUE "0030000 XXX".
              10 FILLER PIC X(19) VALUE "0031000 XXXI".
              10 FILLER PIC X(19) VALUE "0032000 XXXII".
              10 FILLER PIC X(19) VALUE "0033000 XXXIII".
              10 FILLER PIC X(19) VALUE "0034000 XXXIV".
              10 FILLER PIC X(19) VALUE "0035000 XXXV".
              10 FILLER PIC X(19) VALUE "0036000 XXXVI".
              10 FILLER PIC X(19) VALUE "0037000 XXXVII".
              10 FILLER PIC X(19) VALUE "0038000 XXXVIII".
              10 FILLER PIC X(19) VALUE "0039000 XXXIX".
              10 FILLER PIC X(19) VALUE "0040000 XL".
              10 FILLER PIC X(19) VALUE "0041000 XLI".
              10 FILLER PIC X(19) VALUE "0042000 XLII".
              10 FILLER PIC X(19) VALUE "0043000 XLIII".
              10 FILLER PIC X(19) VALUE "0044000 XLIV".
              10 FILLER PIC X(19) VALUE "0045000 XLV".
              10 FILLER PIC X(19) VALUE "0046000 XLVI".
              10 FILLER PIC X(19) VALUE "0047000 XLVII".
              10 FILLER PIC X(19) VALUE "0048000 XLVIII".
              10 FILLER PIC X(19) VALUE "0049000 XLIX".
              10 FILLER PIC X(19) VALUE "0050000 L".
              10 FILLER PIC X(19) VALUE "0051000 LI".
              10 FILLER PIC X(19) VALUE "0052000 LII".
              10 FILLER PIC X(19) VALUE "0053000 LIII".
              10 FILLER PIC X(19) VALUE "0054000 LIV".
              10 FILLER PIC X(19) VALUE "0055000 LV".
              10 FILLER PIC X(19) VALUE "0056000 LVI".
              10 FILLER PIC X(19) VALUE "0057000 LVII".
              10 FILLER PIC X(19) VALUE "0058000 LVIII".
              10 FILLER PIC X(19) VALUE "0059000 LIX".
              10 FILLER PIC X(19) VALUE "0060000 LX".
              10 FILLER PIC X(19) VALUE "0061000 LXI".
              10 FILLER PIC X(19) VALUE "0062000 LXII".
              10 FILLER PIC X(19) VALUE "0063000 LXIII".
              10 FILLER PIC X(19) VALUE "0064000 LXIV".
              10 FILLER PIC X(19) VALUE "0065000 LXV".
              10 FILLER PIC X(19) VALUE "0066000 LXVI".
              10 FILLER PIC X(19) VALUE "0067000 LXVII".
              10 FILLER PIC X(19) VALUE "0068000 LXVIII".
              10 FILLER PIC X(19) VALUE "0069000 LXIX".
              10 FILLER PIC X(19) VALUE "0070000 LXX".
              10 FILLER PIC X(19) VALUE "0071000 LXXI".
              10 FILLER PIC X(19) VALUE "0072000 LXXII".
              10 FILLER PIC X(19) VALUE "0073000 LXXIII".
              10 FILLER PIC X(19) VALUE "0074000 LXXIV".
              10 FILLER PIC X(19) VALUE "0075000 LXXV".
              10 FILLER PIC X(19) VALUE "0076000 LXXVI".
              10 FILLER PIC X(19) VALUE "0077000 LXXVII".
              10 FILLER PIC X(19) VALUE "0078000 LXXVIII".
              10 FILLER PIC X(19) VALUE "0079000 LXXIX".
              10 FILLER PIC X(19) VALUE "0080000 LXXX".
              10 FILLER PIC X(19) VALUE "0081000 LXXXI".
              10 FILLER PIC X(19) VALUE "0082000 LXXXII".
              10 FILLER PIC X(19) VALUE "0083000 LXXXIII".
              10 FILLER PIC X(19) VALUE "0084000 LXXXIV".
              10 FILLER PIC X(19) VALUE "0085000 LXXXV".
              10 FILLER PIC X(19) VALUE "0086000 LXXXVI".
              10 FILLER PIC X(19) VALUE "0087000 LXXXVII".
              10 FILLER PIC X(19) VALUE "0088000 LXXXVIII".
              10 FILLER PIC X(19) VALUE "0089000 LXXXIX".
              10 FILLER PIC X(19) VALUE "0090000 XC".
              10 FILLER PIC X(19) VALUE "0091000 XCI".
              10 FILLER PIC X(19) VALUE "0092000 XCII".
              10 FILLER PIC X(19) VALUE "0093000 XCIII".
              10 FILLER PIC X(19) VALUE "0094000 XCIV".
              10 FILLER PIC X(19) VALUE "0095000 XCV".
              10 FILLER PIC X(19) VALUE "0096000 XCVI".
              10 FILLER PIC X(19) VALUE "0097000 XCVII".
              10 FILLER PIC X(19) VALUE "0098000 XCVIII".
              10 FILLER PIC X(19) VALUE "0099000 XCIX".
              10 FILLER PIC X(19) VALUE "0100000 C".
              10 FILLER PIC X(19) VALUE "0101000 CI".
              10 FILLER PIC X(19) VALUE "0102000 CII".
              10 FILLER PIC X(19) VALUE "0103000 CIII".
              10 FILLER PIC X(19) VALUE "0104000 CIV".
              10 FILLER PIC X(19) VALUE "0105000 CV".
              10 FILLER PIC X(19) VALUE "0106000 CVI".
              10 FILLER PIC X(19) VALUE "0107000 CVII".
              10 FILLER PIC X(19) VALUE "0108000 CVIII".
              10 FILLER PIC X(19) VALUE "0109000 CIX".
              10 FILLER PIC X(19) VALUE "0110000 CX".
              10 FILLER PIC X(19) VALUE "0111000 CXI".
              10 FILLER PIC X(19) VALUE "0112000 CXII".
              10 FILLER PIC X(19) VALUE "0113000 CXIII".
              10 FILLER PIC X(19) VALUE "0114000 CXIV".
              10 FILLER PIC X(19) VALUE "0115000 CXV".
              10 FILLER PIC X(19) VALUE "0116000 CXVI".
              10 FILLER PIC X(19) VALUE "0117000 CXVII".
              10 FILLER PIC X(19) VALUE "0118000 CXVIII".
              10 FILLER PIC X(19) VALUE "0119000 CXIX".
              10 FILLER PIC X(19) VALUE "0120000 CXX".
              10 FILLER PIC X(19) VALUE "0121000 CXXI".
              10 FILLER PIC X(19) VALUE "0122000 CXXII".
              10 FILLER PIC X(19) VALUE "0123000 CXXIII".
              10 FILLER PIC X(19) VALUE "0124000 CXXIV".
              10 FILLER PIC X(19) VALUE "0125000 CXXV".
              10 FILLER PIC X(19) VALUE "0126000 CXXVI".
              10 FILLER PIC X(19) VALUE "0127000 CXXVII".
              10 FILLER PIC X(19) VALUE "0128000 CXXVIII".
              10 FILLER PIC X(19) VALUE "0129000 CXXIX".
              10 FILLER PIC X(19) VALUE "0130000 CXXX".
              10 FILLER PIC X(19) VALUE "0131000 CXXXI".
              10 FILLER PIC X(19) VALUE "0132000 CXXXII".
              10 FILLER PIC X(19) VALUE "0133000 CXXXIII".
              10 FILLER PIC X(19) VALUE "0134000 CXXXIV".
              10 FILLER PIC X(19) VALUE "0135000 CXXXV".
              10 FILLER PIC X(19) VALUE "0136000 CXXXVI".
              10 FILLER PIC X(19) VALUE "0137000 CXXXVII".
              10 FILLER PIC X(19) VALUE "0138000 CXXXVIII".
              10 FILLER PIC X(19) VALUE "0139000 CXXXIX".
              10 FILLER PIC X(19) VALUE "0140000 CXL".
              10 FILLER PIC X(19) VALUE "0141000 CXLI".
              10 FILLER PIC X(19) VALUE "0142000 CXLII".
              10 FILLER PIC X(19) VALUE "0143000 CXLIII".
              10 FILLER PIC X(19) VALUE "0144000 CXLIV".
              10 FILLER PIC X(19) VALUE "0145000 CXLV".
              10 FILLER PIC X(19) VALUE "0146000 CXLVI".
              10 FILLER PIC X(19) VALUE "0147000 CXLVII".
              10 FILLER PIC X(19) VALUE "0148000 CXLVIII".
              10 FILLER PIC X(19) VALUE "0149000 CXLIX".
              10 FILLER PIC X(19) VALUE "0150000 CL".
              10 FILLER PIC X(19) VALUE "0151000 CLI".
              10 FILLER PIC X(19) VALUE "0152000 CLII".
              10 FILLER PIC X(19) VALUE "0153000 CLIII".
              10 FILLER PIC X(19) VALUE "0154000 CLIV".
              10 FILLER PIC X(19) VALUE "0155000 CLV".
              10 FILLER PIC X(19) VALUE "0156000 CLVI".
              10 FILLER PIC X(19) VALUE "0157000 CLVII".
              10 FILLER PIC X(19) VALUE "0158000 CLVIII".
              10 FILLER PIC X(19) VALUE "0159000 CLIX".
              10 FILLER PIC X(19) VALUE "0160000 CLX".
              10 FILLER PIC X(19) VALUE "0161000 CLXI".
              10 FILLER PIC X(19) VALUE "0162000 CLXII".
              10 FILLER PIC X(19) VALUE "0163000 CLXIII".
              10 FILLER PIC X(19) VALUE "0164000 CLXIV".
              10 FILLER PIC X(19) VALUE "0165000 CLXV".
              10 FILLER PIC X(19) VALUE "0166000 CLXVI".
              10 FILLER PIC X(19) VALUE "0167000 CLXVII".
              10 FILLER PIC X(19) VALUE "0168000 CLXVIII".
              10 FILLER PIC X(19) VALUE "0169000 CLXIX".
              10 FILLER PIC X(19) VALUE "0170000 CLXX".
              10 FILLER PIC X(19) VALUE "0171000 CLXXI".
              10 FILLER PIC X(19) VALUE "0172000 CLXXII".
              10 FILLER PIC X(19) VALUE "0173000 CLXXIII".
              10 FILLER PIC X(19) VALUE "0174000 CLXXIV".
              10 FILLER PIC X(19) VALUE "0175000 CLXXV".
              10 FILLER PIC X(19) VALUE "0176000 CLXXVI".
              10 FILLER PIC X(19) VALUE "0177000 CLXXVII".
              10 FILLER PIC X(19) VALUE "0178000 CLXXVIII".
              10 FILLER PIC X(19) VALUE "0179000 CLXXIX".
              10 FILLER PIC X(19) VALUE "0180000 CLXXX".
              10 FILLER PIC X(19) VALUE "0181000 CLXXXI".
              10 FILLER PIC X(19) VALUE "0182000 CLXXXII".
              10 FILLER PIC X(19) VALUE "0183000 CLXXXIII".
              10 FILLER PIC X(19) VALUE "0184000 CLXXXIV".
              10 FILLER PIC X(19) VALUE "0185000 CLXXXV".
              10 FILLER PIC X(19) VALUE "0186000 CLXXXVI".
              10 FILLER PIC X(19) VALUE "0187000 CLXXXVII".
              10 FILLER PIC X(19) VALUE "0188000 CLXXXVIII".
              10 FILLER PIC X(19) VALUE "0189000 CLXXXIX".
              10 FILLER PIC X(19) VALUE "0190000 CXC".
              10 FILLER PIC X(19) VALUE "0191000 CXCI".
              10 FILLER PIC X(19) VALUE "0192000 CXCII".
              10 FILLER PIC X(19) VALUE "0193000 CXCIII".
              10 FILLER PIC X(19) VALUE "0194000 CXCIV".
              10 FILLER PIC X(19) VALUE "0195000 CXCV".
              10 FILLER PIC X(19) VALUE "0196000 CXCVI".
              10 FILLER PIC X(19) VALUE "0197000 CXCVII".
              10 FILLER PIC X(19) VALUE "0198000 CXCVIII".
              10 FILLER PIC X(19) VALUE "0199000 CXCIX".
              10 FILLER PIC X(19) VALUE "0200000 CC".
              10 FILLER PIC X(19) VALUE "0201000 CCI".
              10 FILLER PIC X(19) VALUE "0202000 CCII".
              10 FILLER PIC X(19) VALUE "0203000 CCIII".
              10 FILLER PIC X(19) VALUE "0204000 CCIV".
              10 FILLER PIC X(19) VALUE "0205000 CCV".
              10 FILLER PIC X(19) VALUE "0206000 CCVI".
              10 FILLER PIC X(19) VALUE "0207000 CCVII".
              10 FILLER PIC X(19) VALUE "0208000 CCVIII".
              10 FILLER PIC X(19) VALUE "0209000 CCIX".
              10 FILLER PIC X(19) VALUE "0210000 CCX".
              10 FILLER PIC X(19) VALUE "0211000 CCXI".
              10 FILLER PIC X(19) VALUE "0212000 CCXII".
              10 FILLER PIC X(19) VALUE "0213000 CCXIII".
              10 FILLER PIC X(19) VALUE "0214000 CCXIV".
              10 FILLER PIC X(19) VALUE "0215000 CCXV".
              10 FILLER PIC X(19) VALUE "0216000 CCXVI".
              10 FILLER PIC X(19) VALUE "0217000 CCXVII".
              10 FILLER PIC X(19) VALUE "0218000 CCXVIII".
              10 FILLER PIC X(19) VALUE "0219000 CCXIX".
              10 FILLER PIC X(19) VALUE "0220000 CCXX".
              10 FILLER PIC X(19) VALUE "0221000 CCXXI".
              10 FILLER PIC X(19) VALUE "0222000 CCXXII".
              10 FILLER PIC X(19) VALUE "0223000 CCXXIII".
              10 FILLER PIC X(19) VALUE "0224000 CCXXIV".
              10 FILLER PIC X(19) VALUE "0225000 CCXXV".
              10 FILLER PIC X(19) VALUE "0226000 CCXXVI".
              10 FILLER PIC X(19) VALUE "0227000 CCXXVII".
              10 FILLER PIC X(19) VALUE "0228000 CCXXVIII".
              10 FILLER PIC X(19) VALUE "0229000 CCXXIX".
              10 FILLER PIC X(19) VALUE "0230000 CCXXX".
              10 FILLER PIC X(19) VALUE "0231000 CCXXXI".
              10 FILLER PIC X(19) VALUE "0232000 CCXXXII".
              10 FILLER PIC X(19) VALUE "0233000 CCXXXIII".
              10 FILLER PIC X(19) VALUE "0234000 CCXXXIV".
              10 FILLER PIC X(19) VALUE "0235000 CCXXXV".
              10 FILLER PIC X(19) VALUE "0236000 CCXXXVI".
              10 FILLER PIC X(19) VALUE "0237000 CCXXXVII".
              10 FILLER PIC X(19) VALUE "0238000 CCXXXVIII".
              10 FILLER PIC X(19) VALUE "0239000 CCXXXIX".
              10 FILLER PIC X(19) VALUE "0240000 CCXL".
              10 FILLER PIC X(19) VALUE "0241000 CCXLI".
              10 FILLER PIC X(19) VALUE "0242000 CCXLII".
              10 FILLER PIC X(19) VALUE "0243000 CCXLIII".
              10 FILLER PIC X(19) VALUE "0244000 CCXLIV".
              10 FILLER PIC X(19) VALUE "0245000 CCXLV".
              10 FILLER PIC X(19) VALUE "0246000 CCXLVI".
              10 FILLER PIC X(19) VALUE "0247000 CCXLVII".
              10 FILLER PIC X(19) VALUE "0248000 CCXLVIII".
              10 FILLER PIC X(19) VALUE "0249000 CCXLIX".
              10 FILLER PIC X(19) VALUE "0250000 CCL".
              10 FILLER PIC X(19) VALUE "0251000 CCLI".
              10 FILLER PIC X(19) VALUE "0252000 CCLII".
              10 FILLER PIC X(19) VALUE "0253000 CCLIII".
              10 FILLER PIC X(19) VALUE "0254000 CCLIV".
              10 FILLER PIC X(19) VALUE "0255000 CCLV".
              10 FILLER PIC X(19) VALUE "0256000 CCLVI".
              10 FILLER PIC X(19) VALUE "0257000 CCLVII".
              10 FILLER PIC X(19) VALUE "0258000 CCLVIII".
              10 FILLER PIC X(19) VALUE "0259000 CCLIX".
              10 FILLER PIC X(19) VALUE "0260000 CCLX".
              10 FILLER PIC X(19) VALUE "0261000 CCLXI".
              10 FILLER PIC X(19) VALUE "0262000 CCLXII".
              10 FILLER PIC X(19) VALUE "0263000 CCLXIII".
              10 FILLER PIC X(19) VALUE "0264000 CCLXIV".
              10 FILLER PIC X(19) VALUE "0265000 CCLXV".
              10 FILLER PIC X(19) VALUE "0266000 CCLXVI".
              10 FILLER PIC X(19) VALUE "0267000 CCLXVII".
              10 FILLER PIC X(19) VALUE "0268000 CCLXVIII".
              10 FILLER PIC X(19) VALUE "0269000 CCLXIX".
              10 FILLER PIC X(19) VALUE "0270000 CCLXX".
              10 FILLER PIC X(19) VALUE "0271000 CCLXXI".
              10 FILLER PIC X(19) VALUE "0272000 CCLXXII".
              10 FILLER PIC X(19) VALUE "0273000 CCLXXIII".
              10 FILLER PIC X(19) VALUE "0274000 CCLXXIV".
              10 FILLER PIC X(19) VALUE "0275000 CCLXXV".
              10 FILLER PIC X(19) VALUE "0276000 CCLXXVI".
              10 FILLER PIC X(19) VALUE "0277000 CCLXXVII".
              10 FILLER PIC X(19) VALUE "0278000 CCLXXVIII".
              10 FILLER PIC X(19) VALUE "0279000 CCLXXIX".
              10 FILLER PIC X(19) VALUE "0280000 CCLXXX".
              10 FILLER PIC X(19) VALUE "0281000 CCLXXXI".
              10 FILLER PIC X(19) VALUE "0282000 CCLXXXII".
              10 FILLER PIC X(19) VALUE "0283000 CCLXXXIII".
              10 FILLER PIC X(19) VALUE "0284000 CCLXXXIV".
              10 FILLER PIC X(19) VALUE "0285000 CCLXXXV".
              10 FILLER PIC X(19) VALUE "0286000 CCLXXXVI".
              10 FILLER PIC X(19) VALUE "0287000 CCLXXXVII".
              10 FILLER PIC X(19) VALUE "0288000 CCLXXXVIII".
              10 FILLER PIC X(19) VALUE "0289000 CCLXXXIX".
              10 FILLER PIC X(19) VALUE "0290000 CCXC".
              10 FILLER PIC X(19) VALUE "0291000 CCXCI".
              10 FILLER PIC X(19) VALUE "0292000 CCXCII".
              10 FILLER PIC X(19) VALUE "0293000 CCXCIII".
              10 FILLER PIC X(19) VALUE "0294000 CCXCIV".
              10 FILLER PIC X(19) VALUE "0295000 CCXCV".
              10 FILLER PIC X(19) VALUE "0296000 CCXCVI".
              10 FILLER PIC X(19) VALUE "0297000 CCXCVII".
              10 FILLER PIC X(19) VALUE "0298000 CCXCVIII".
              10 FILLER PIC X(19) VALUE "0299000 CCXCIX".
              10 FILLER PIC X(19) VALUE "0300000 CCC".
              10 FILLER PIC X(19) VALUE "0301000 CCCI".
              10 FILLER PIC X(19) VALUE "0302000 CCCII".
              10 FILLER PIC X(19) VALUE "0303000 CCCIII".
              10 FILLER PIC X(19) VALUE "0304000 CCCIV".
              10 FILLER PIC X(19) VALUE "0305000 CCCV".
              10 FILLER PIC X(19) VALUE "0306000 CCCVI".
              10 FILLER PIC X(19) VALUE "0307000 CCCVII".
              10 FILLER PIC X(19) VALUE "0308000 CCCVIII".
              10 FILLER PIC X(19) VALUE "0309000 CCCIX".
              10 FILLER PIC X(19) VALUE "0310000 CCCX".
              10 FILLER PIC X(19) VALUE "0311000 CCCXI".
              10 FILLER PIC X(19) VALUE "0312000 CCCXII".
              10 FILLER PIC X(19) VALUE "0313000 CCCXIII".
              10 FILLER PIC X(19) VALUE "0314000 CCCXIV".
              10 FILLER PIC X(19) VALUE "0315000 CCCXV".
              10 FILLER PIC X(19) VALUE "0316000 CCCXVI".
              10 FILLER PIC X(19) VALUE "0317000 CCCXVII".
              10 FILLER PIC X(19) VALUE "0318000 CCCXVIII".
              10 FILLER PIC X(19) VALUE "0319000 CCCXIX".
              10 FILLER PIC X(19) VALUE "0320000 CCCXX".
              10 FILLER PIC X(19) VALUE "0321000 CCCXXI".
              10 FILLER PIC X(19) VALUE "0322000 CCCXXII".
              10 FILLER PIC X(19) VALUE "0323000 CCCXXIII".
              10 FILLER PIC X(19) VALUE "0324000 CCCXXIV".
              10 FILLER PIC X(19) VALUE "0325000 CCCXXV".
              10 FILLER PIC X(19) VALUE "0326000 CCCXXVI".
              10 FILLER PIC X(19) VALUE "0327000 CCCXXVII".
              10 FILLER PIC X(19) VALUE "0328000 CCCXXVIII".
              10 FILLER PIC X(19) VALUE "0329000 CCCXXIX".
              10 FILLER PIC X(19) VALUE "0330000 CCCXXX".
              10 FILLER PIC X(19) VALUE "0331000 CCCXXXI".
              10 FILLER PIC X(19) VALUE "0332000 CCCXXXII".
              10 FILLER PIC X(19) VALUE "0333000 CCCXXXIII".
              10 FILLER PIC X(19) VALUE "0334000 CCCXXXIV".
              10 FILLER PIC X(19) VALUE "0335000 CCCXXXV".
              10 FILLER PIC X(19) VALUE "0336000 CCCXXXVI".
              10 FILLER PIC X(19) VALUE "0337000 CCCXXXVII".
              10 FILLER PIC X(19) VALUE "0338000 CCCXXXVIII".
              10 FILLER PIC X(19) VALUE "0339000 CCCXXXIX".
              10 FILLER PIC X(19) VALUE "0340000 CCCXL".
              10 FILLER PIC X(19) VALUE "0341000 CCCXLI".
              10 FILLER PIC X(19) VALUE "0342000 CCCXLII".
              10 FILLER PIC X(19) VALUE "0343000 CCCXLIII".
              10 FILLER PIC X(19) VALUE "0344000 CCCXLIV".
              10 FILLER PIC X(19) VALUE "0345000 CCCXLV".
              10 FILLER PIC X(19) VALUE "0346000 CCCXLVI".
              10 FILLER PIC X(19) VALUE "0347000 CCCXLVII".
              10 FILLER PIC X(19) VALUE "0348000 CCCXLVIII".
              10 FILLER PIC X(19) VALUE "0349000 CCCXLIX".
              10 FILLER PIC X(19) VALUE "0350000 CCCL".
              10 FILLER PIC X(19) VALUE "0351000 CCCLI".
              10 FILLER PIC X(19) VALUE "0352000 CCCLII".
              10 FILLER PIC X(19) VALUE "0353000 CCCLIII".
              10 FILLER PIC X(19) VALUE "0354000 CCCLIV".
              10 FILLER PIC X(19) VALUE "0355000 CCCLV".
              10 FILLER PIC X(19) VALUE "0356000 CCCLVI".
              10 FILLER PIC X(19) VALUE "0357000 CCCLVII".
              10 FILLER PIC X(19) VALUE "0358000 CCCLVIII".
              10 FILLER PIC X(19) VALUE "0359000 CCCLIX".
              10 FILLER PIC X(19) VALUE "0360000 CCCLX".
              10 FILLER PIC X(19) VALUE "0361000 CCCLXI".
              10 FILLER PIC X(19) VALUE "0362000 CCCLXII".
              10 FILLER PIC X(19) VALUE "0363000 CCCLXIII".
              10 FILLER PIC X(19) VALUE "0364000 CCCLXIV".
              10 FILLER PIC X(19) VALUE "0365000 CCCLXV".
              10 FILLER PIC X(19) VALUE "0366000 CCCLXVI".
              10 FILLER PIC X(19) VALUE "0367000 CCCLXVII".
              10 FILLER PIC X(19) VALUE "0368000 CCCLXVIII".
              10 FILLER PIC X(19) VALUE "0369000 CCCLXIX".
              10 FILLER PIC X(19) VALUE "0370000 CCCLXX".
              10 FILLER PIC X(19) VALUE "0371000 CCCLXXI".
              10 FILLER PIC X(19) VALUE "0372000 CCCLXXII".
              10 FILLER PIC X(19) VALUE "0373000 CCCLXXIII".
              10 FILLER PIC X(19) VALUE "0374000 CCCLXXIV".
              10 FILLER PIC X(19) VALUE "0375000 CCCLXXV".
              10 FILLER PIC X(19) VALUE "0376000 CCCLXXVI".
              10 FILLER PIC X(19) VALUE "0377000 CCCLXXVII".
              10 FILLER PIC X(19) VALUE "0378000 CCCLXXVIII".
              10 FILLER PIC X(19) VALUE "0379000 CCCLXXIX".
              10 FILLER PIC X(19) VALUE "0380000 CCCLXXX".
              10 FILLER PIC X(19) VALUE "0381000 CCCLXXXI".
              10 FILLER PIC X(19) VALUE "0382000 CCCLXXXII".
              10 FILLER PIC X(19) VALUE "0383000 CCCLXXXIII".
              10 FILLER PIC X(19) VALUE "0384000 CCCLXXXIV".
              10 FILLER PIC X(19) VALUE "0385000 CCCLXXXV".
              10 FILLER PIC X(19) VALUE "0386000 CCCLXXXVI".
              10 FILLER PIC X(19) VALUE "0387000 CCCLXXXVII".
              10 FILLER PIC X(19) VALUE "0388000 CCCLXXXVIII".
              10 FILLER PIC X(19) VALUE "0389000 CCCLXXXIX".
              10 FILLER PIC X(19) VALUE "0390000 CCCXC".
              10 FILLER PIC X(19) VALUE "0391000 CCCXCI".
              10 FILLER PIC X(19) VALUE "0392000 CCCXCII".
              10 FILLER PIC X(19) VALUE "0393000 CCCXCIII".
              10 FILLER PIC X(19) VALUE "0394000 CCCXCIV".
              10 FILLER PIC X(19) VALUE "0395000 CCCXCV".
              10 FILLER PIC X(19) VALUE "0396000 CCCXCVI".
              10 FILLER PIC X(19) VALUE "0397000 CCCXCVII".
              10 FILLER PIC X(19) VALUE "0398000 CCCXCVIII".
              10 FILLER PIC X(19) VALUE "0399000 CCCXCIX".
              10 FILLER PIC X(19) VALUE "0400000 CD".
              10 FILLER PIC X(19) VALUE "0401000 CDI".
              10 FILLER PIC X(19) VALUE "0402000 CDII".
              10 FILLER PIC X(19) VALUE "0403000 CDIII".
              10 FILLER PIC X(19) VALUE "0404000 CDIV".
              10 FILLER PIC X(19) VALUE "0405000 CDV".
              10 FILLER PIC X(19) VALUE "0406000 CDVI".
              10 FILLER PIC X(19) VALUE "0407000 CDVII".
              10 FILLER PIC X(19) VALUE "0408000 CDVIII".
              10 FILLER PIC X(19) VALUE "0409000 CDIX".
              10 FILLER PIC X(19) VALUE "0410000 CDX".
              10 FILLER PIC X(19) VALUE "0411000 CDXI".
              10 FILLER PIC X(19) VALUE "0412000 CDXII".
              10 FILLER PIC X(19) VALUE "0413000 CDXIII".
              10 FILLER PIC X(19) VALUE "0414000 CDXIV".
              10 FILLER PIC X(19) VALUE "0415000 CDXV".
              10 FILLER PIC X(19) VALUE "0416000 CDXVI".
              10 FILLER PIC X(19) VALUE "0417000 CDXVII".
              10 FILLER PIC X(19) VALUE "0418000 CDXVIII".
              10 FILLER PIC X(19) VALUE "0419000 CDXIX".
              10 FILLER PIC X(19) VALUE "0420000 CDXX".
              10 FILLER PIC X(19) VALUE "0421000 CDXXI".
              10 FILLER PIC X(19) VALUE "0422000 CDXXII".
              10 FILLER PIC X(19) VALUE "0423000 CDXXIII".
              10 FILLER PIC X(19) VALUE "0424000 CDXXIV".
              10 FILLER PIC X(19) VALUE "0425000 CDXXV".
              10 FILLER PIC X(19) VALUE "0426000 CDXXVI".
              10 FILLER PIC X(19) VALUE "0427000 CDXXVII".
              10 FILLER PIC X(19) VALUE "0428000 CDXXVIII".
              10 FILLER PIC X(19) VALUE "0429000 CDXXIX".
              10 FILLER PIC X(19) VALUE "0430000 CDXXX".
              10 FILLER PIC X(19) VALUE "0431000 CDXXXI".
              10 FILLER PIC X(19) VALUE "0432000 CDXXXII".
              10 FILLER PIC X(19) VALUE "0433000 CDXXXIII".
              10 FILLER PIC X(19) VALUE "0434000 CDXXXIV".
              10 FILLER PIC X(19) VALUE "0435000 CDXXXV".
              10 FILLER PIC X(19) VALUE "0436000 CDXXXVI".
              10 FILLER PIC X(19) VALUE "0437000 CDXXXVII".
              10 FILLER PIC X(19) VALUE "0438000 CDXXXVIII".
              10 FILLER PIC X(19) VALUE "0439000 CDXXXIX".
              10 FILLER PIC X(19) VALUE "0440000 CDXL".
              10 FILLER PIC X(19) VALUE "0441000 CDXLI".
              10 FILLER PIC X(19) VALUE "0442000 CDXLII".
              10 FILLER PIC X(19) VALUE "0443000 CDXLIII".
              10 FILLER PIC X(19) VALUE "0444000 CDXLIV".
              10 FILLER PIC X(19) VALUE "0445000 CDXLV".
              10 FILLER PIC X(19) VALUE "0446000 CDXLVI".
              10 FILLER PIC X(19) VALUE "0447000 CDXLVII".
              10 FILLER PIC X(19) VALUE "0448000 CDXLVIII".
              10 FILLER PIC X(19) VALUE "0449000 CDXLIX".
              10 FILLER PIC X(19) VALUE "0450000 CDL".
              10 FILLER PIC X(19) VALUE "0451000 CDLI".
              10 FILLER PIC X(19) VALUE "0452000 CDLII".
              10 FILLER PIC X(19) VALUE "0453000 CDLIII".
              10 FILLER PIC X(19) VALUE "0454000 CDLIV".
              10 FILLER PIC X(19) VALUE "0455000 CDLV".
              10 FILLER PIC X(19) VALUE "0456000 CDLVI".
              10 FILLER PIC X(19) VALUE "0457000 CDLVII".
              10 FILLER PIC X(19) VALUE "0458000 CDLVIII".
              10 FILLER PIC X(19) VALUE "0459000 CDLIX".
              10 FILLER PIC X(19) VALUE "0460000 CDLX".
              10 FILLER PIC X(19) VALUE "0461000 CDLXI".
              10 FILLER PIC X(19) VALUE "0462000 CDLXII".
              10 FILLER PIC X(19) VALUE "0463000 CDLXIII".
              10 FILLER PIC X(19) VALUE "0464000 CDLXIV".
              10 FILLER PIC X(19) VALUE "0465000 CDLXV".
              10 FILLER PIC X(19) VALUE "0466000 CDLXVI".
              10 FILLER PIC X(19) VALUE "0467000 CDLXVII".
              10 FILLER PIC X(19) VALUE "0468000 CDLXVIII".
              10 FILLER PIC X(19) VALUE "0469000 CDLXIX".
              10 FILLER PIC X(19) VALUE "0470000 CDLXX".
              10 FILLER PIC X(19) VALUE "0471000 CDLXXI".
              10 FILLER PIC X(19) VALUE "0472000 CDLXXII".
              10 FILLER PIC X(19) VALUE "0473000 CDLXXIII".
              10 FILLER PIC X(19) VALUE "0474000 CDLXXIV".
              10 FILLER PIC X(19) VALUE "0475000 CDLXXV".
              10 FILLER PIC X(19) VALUE "0476000 CDLXXVI".
              10 FILLER PIC X(19) VALUE "0477000 CDLXXVII".
              10 FILLER PIC X(19) VALUE "0478000 CDLXXVIII".
              10 FILLER PIC X(19) VALUE "0479000 CDLXXIX".
              10 FILLER PIC X(19) VALUE "0480000 CDLXXX".
              10 FILLER PIC X(19) VALUE "0481000 CDLXXXI".
              10 FILLER PIC X(19) VALUE "0482000 CDLXXXII".
              10 FILLER PIC X(19) VALUE "0483000 CDLXXXIII".
              10 FILLER PIC X(19) VALUE "0484000 CDLXXXIV".
              10 FILLER PIC X(19) VALUE "0485000 CDLXXXV".
              10 FILLER PIC X(19) VALUE "0486000 CDLXXXVI".
              10 FILLER PIC X(19) VALUE "0487000 CDLXXXVII".
              10 FILLER PIC X(19) VALUE "0488000 CDLXXXVIII".
              10 FILLER PIC X(19) VALUE "0489000 CDLXXXIX".
              10 FILLER PIC X(19) VALUE "0490000 CDXC".
              10 FILLER PIC X(19) VALUE "0491000 CDXCI".
              10 FILLER PIC X(19) VALUE "0492000 CDXCII".
              10 FILLER PIC X(19) VALUE "0493000 CDXCIII".
              10 FILLER PIC X(19) VALUE "0494000 CDXCIV".
              10 FILLER PIC X(19) VALUE "0495000 CDXCV".
              10 FILLER PIC X(19) VALUE "0496000 CDXCVI".
              10 FILLER PIC X(19) VALUE "0497000 CDXCVII".
              10 FILLER PIC X(19) VALUE "0498000 CDXCVIII".
              10 FILLER PIC X(19) VALUE "0499000 CDXCIX".
              10 FILLER PIC X(19) VALUE "0500000 D".
              10 FILLER PIC X(19) VALUE "0501000 DI".
              10 FILLER PIC X(19) VALUE "0502000 DII".
              10 FILLER PIC X(19) VALUE "0503000 DIII".
              10 FILLER PIC X(19) VALUE "0504000 DIV".
              10 FILLER PIC X(19) VALUE "0505000 DV".
              10 FILLER PIC X(19) VALUE "0506000 DVI".
              10 FILLER PIC X(19) VALUE "0507000 DVII".
              10 FILLER PIC X(19) VALUE "0508000 DVIII".
              10 FILLER PIC X(19) VALUE "0509000 DIX".
              10 FILLER PIC X(19) VALUE "0510000 DX".
              10 FILLER PIC X(19) VALUE "0511000 DXI".
              10 FILLER PIC X(19) VALUE "0512000 DXII".
              10 FILLER PIC X(19) VALUE "0513000 DXIII".
              10 FILLER PIC X(19) VALUE "0514000 DXIV".
              10 FILLER PIC X(19) VALUE "0515000 DXV".
              10 FILLER PIC X(19) VALUE "0516000 DXVI".
              10 FILLER PIC X(19) VALUE "0517000 DXVII".
              10 FILLER PIC X(19) VALUE "0518000 DXVIII".
              10 FILLER PIC X(19) VALUE "0519000 DXIX".
              10 FILLER PIC X(19) VALUE "0520000 DXX".
              10 FILLER PIC X(19) VALUE "0521000 DXXI".
              10 FILLER PIC X(19) VALUE "0522000 DXXII".
              10 FILLER PIC X(19) VALUE "0523000 DXXIII".
              10 FILLER PIC X(19) VALUE "0524000 DXXIV".
              10 FILLER PIC X(19) VALUE "0525000 DXXV".
              10 FILLER PIC X(19) VALUE "0526000 DXXVI".
              10 FILLER PIC X(19) VALUE "0527000 DXXVII".
              10 FILLER PIC X(19) VALUE "0528000 DXXVIII".
              10 FILLER PIC X(19) VALUE "0529000 DXXIX".
              10 FILLER PIC X(19) VALUE "0530000 DXXX".
              10 FILLER PIC X(19) VALUE "0531000 DXXXI".
              10 FILLER PIC X(19) VALUE "0532000 DXXXII".
              10 FILLER PIC X(19) VALUE "0533000 DXXXIII".
              10 FILLER PIC X(19) VALUE "0534000 DXXXIV".
              10 FILLER PIC X(19) VALUE "0535000 DXXXV".
              10 FILLER PIC X(19) VALUE "0536000 DXXXVI".
              10 FILLER PIC X(19) VALUE "0537000 DXXXVII".
              10 FILLER PIC X(19) VALUE "0538000 DXXXVIII".
              10 FILLER PIC X(19) VALUE "0539000 DXXXIX".
              10 FILLER PIC X(19) VALUE "0540000 DXL".
              10 FILLER PIC X(19) VALUE "0541000 DXLI".
              10 FILLER PIC X(19) VALUE "0542000 DXLII".
              10 FILLER PIC X(19) VALUE "0543000 DXLIII".
              10 FILLER PIC X(19) VALUE "0544000 DXLIV".
              10 FILLER PIC X(19) VALUE "0545000 DXLV".
              10 FILLER PIC X(19) VALUE "0546000 DXLVI".
              10 FILLER PIC X(19) VALUE "0547000 DXLVII".
              10 FILLER PIC X(19) VALUE "0548000 DXLVIII".
              10 FILLER PIC X(19) VALUE "0549000 DXLIX".
              10 FILLER PIC X(19) VALUE "0550000 DL".
              10 FILLER PIC X(19) VALUE "0551000 DLI".
              10 FILLER PIC X(19) VALUE "0552000 DLII".
              10 FILLER PIC X(19) VALUE "0553000 DLIII".
              10 FILLER PIC X(19) VALUE "0554000 DLIV".
              10 FILLER PIC X(19) VALUE "0555000 DLV".
              10 FILLER PIC X(19) VALUE "0556000 DLVI".
              10 FILLER PIC X(19) VALUE "0557000 DLVII".
              10 FILLER PIC X(19) VALUE "0558000 DLVIII".
              10 FILLER PIC X(19) VALUE "0559000 DLIX".
              10 FILLER PIC X(19) VALUE "0560000 DLX".
              10 FILLER PIC X(19) VALUE "0561000 DLXI".
              10 FILLER PIC X(19) VALUE "0562000 DLXII".
              10 FILLER PIC X(19) VALUE "0563000 DLXIII".
              10 FILLER PIC X(19) VALUE "0564000 DLXIV".
              10 FILLER PIC X(19) VALUE "0565000 DLXV".
              10 FILLER PIC X(19) VALUE "0566000 DLXVI".
              10 FILLER PIC X(19) VALUE "0567000 DLXVII".
              10 FILLER PIC X(19) VALUE "0568000 DLXVIII".
              10 FILLER PIC X(19) VALUE "0569000 DLXIX".
              10 FILLER PIC X(19) VALUE "0570000 DLXX".
              10 FILLER PIC X(19) VALUE "0571000 DLXXI".
              10 FILLER PIC X(19) VALUE "0572000 DLXXII".
              10 FILLER PIC X(19) VALUE "0573000 DLXXIII".
              10 FILLER PIC X(19) VALUE "0574000 DLXXIV".
              10 FILLER PIC X(19) VALUE "0575000 DLXXV".
              10 FILLER PIC X(19) VALUE "0576000 DLXXVI".
              10 FILLER PIC X(19) VALUE "0577000 DLXXVII".
              10 FILLER PIC X(19) VALUE "0578000 DLXXVIII".
              10 FILLER PIC X(19) VALUE "0579000 DLXXIX".
              10 FILLER PIC X(19) VALUE "0580000 DLXXX".
              10 FILLER PIC X(19) VALUE "0581000 DLXXXI".
              10 FILLER PIC X(19) VALUE "0582000 DLXXXII".
              10 FILLER PIC X(19) VALUE "0583000 DLXXXIII".
              10 FILLER PIC X(19) VALUE "0584000 DLXXXIV".
              10 FILLER PIC X(19) VALUE "0585000 DLXXXV".
              10 FILLER PIC X(19) VALUE "0586000 DLXXXVI".
              10 FILLER PIC X(19) VALUE "0587000 DLXXXVII".
              10 FILLER PIC X(19) VALUE "0588000 DLXXXVIII".
              10 FILLER PIC X(19) VALUE "0589000 DLXXXIX".
              10 FILLER PIC X(19) VALUE "0590000 DXC".
              10 FILLER PIC X(19) VALUE "0591000 DXCI".
              10 FILLER PIC X(19) VALUE "0592000 DXCII".
              10 FILLER PIC X(19) VALUE "0593000 DXCIII".
              10 FILLER PIC X(19) VALUE "0594000 DXCIV".
              10 FILLER PIC X(19) VALUE "0595000 DXCV".
              10 FILLER PIC X(19) VALUE "0596000 DXCVI".
              10 FILLER PIC X(19) VALUE "0597000 DXCVII".
              10 FILLER PIC X(19) VALUE "0598000 DXCVIII".
              10 FILLER PIC X(19) VALUE "0599000 DXCIX".
              10 FILLER PIC X(19) VALUE "0600000 DC".
              10 FILLER PIC X(19) VALUE "0601000 DCI".
              10 FILLER PIC X(19) VALUE "0602000 DCII".
              10 FILLER PIC X(19) VALUE "0603000 DCIII".
              10 FILLER PIC X(19) VALUE "0604000 DCIV".
              10 FILLER PIC X(19) VALUE "0605000 DCV".
              10 FILLER PIC X(19) VALUE "0606000 DCVI".
              10 FILLER PIC X(19) VALUE "0607000 DCVII".
              10 FILLER PIC X(19) VALUE "0608000 DCVIII".
              10 FILLER PIC X(19) VALUE "0609000 DCIX".
              10 FILLER PIC X(19) VALUE "0610000 DCX".
              10 FILLER PIC X(19) VALUE "0611000 DCXI".
              10 FILLER PIC X(19) VALUE "0612000 DCXII".
              10 FILLER PIC X(19) VALUE "0613000 DCXIII".
              10 FILLER PIC X(19) VALUE "0614000 DCXIV".
              10 FILLER PIC X(19) VALUE "0615000 DCXV".
              10 FILLER PIC X(19) VALUE "0616000 DCXVI".
              10 FILLER PIC X(19) VALUE "0617000 DCXVII".
              10 FILLER PIC X(19) VALUE "0618000 DCXVIII".
              10 FILLER PIC X(19) VALUE "0619000 DCXIX".
              10 FILLER PIC X(19) VALUE "0620000 DCXX".
              10 FILLER PIC X(19) VALUE "0621000 DCXXI".
              10 FILLER PIC X(19) VALUE "0622000 DCXXII".
              10 FILLER PIC X(19) VALUE "0623000 DCXXIII".
              10 FILLER PIC X(19) VALUE "0624000 DCXXIV".
              10 FILLER PIC X(19) VALUE "0625000 DCXXV".
              10 FILLER PIC X(19) VALUE "0626000 DCXXVI".
              10 FILLER PIC X(19) VALUE "0627000 DCXXVII".
              10 FILLER PIC X(19) VALUE "0628000 DCXXVIII".
              10 FILLER PIC X(19) VALUE "0629000 DCXXIX".
              10 FILLER PIC X(19) VALUE "0630000 DCXXX".
              10 FILLER PIC X(19) VALUE "0631000 DCXXXI".
              10 FILLER PIC X(19) VALUE "0632000 DCXXXII".
              10 FILLER PIC X(19) VALUE "0633000 DCXXXIII".
              10 FILLER PIC X(19) VALUE "0634000 DCXXXIV".
              10 FILLER PIC X(19) VALUE "0635000 DCXXXV".
              10 FILLER PIC X(19) VALUE "0636000 DCXXXVI".
              10 FILLER PIC X(19) VALUE "0637000 DCXXXVII".
              10 FILLER PIC X(19) VALUE "0638000 DCXXXVIII".
              10 FILLER PIC X(19) VALUE "0639000 DCXXXIX".
              10 FILLER PIC X(19) VALUE "0640000 DCXL".
              10 FILLER PIC X(19) VALUE "0641000 DCXLI".
              10 FILLER PIC X(19) VALUE "0642000 DCXLII".
              10 FILLER PIC X(19) VALUE "0643000 DCXLIII".
              10 FILLER PIC X(19) VALUE "0644000 DCXLIV".
              10 FILLER PIC X(19) VALUE "0645000 DCXLV".
              10 FILLER PIC X(19) VALUE "0646000 DCXLVI".
              10 FILLER PIC X(19) VALUE "0647000 DCXLVII".
              10 FILLER PIC X(19) VALUE "0648000 DCXLVIII".
              10 FILLER PIC X(19) VALUE "0649000 DCXLIX".
              10 FILLER PIC X(19) VALUE "0650000 DCL".
              10 FILLER PIC X(19) VALUE "0651000 DCLI".
              10 FILLER PIC X(19) VALUE "0652000 DCLII".
              10 FILLER PIC X(19) VALUE "0653000 DCLIII".
              10 FILLER PIC X(19) VALUE "0654000 DCLIV".
              10 FILLER PIC X(19) VALUE "0655000 DCLV".
              10 FILLER PIC X(19) VALUE "0656000 DCLVI".
              10 FILLER PIC X(19) VALUE "0657000 DCLVII".
              10 FILLER PIC X(19) VALUE "0658000 DCLVIII".
              10 FILLER PIC X(19) VALUE "0659000 DCLIX".
              10 FILLER PIC X(19) VALUE "0660000 DCLX".
              10 FILLER PIC X(19) VALUE "0661000 DCLXI".
              10 FILLER PIC X(19) VALUE "0662000 DCLXII".
              10 FILLER PIC X(19) VALUE "0663000 DCLXIII".
              10 FILLER PIC X(19) VALUE "0664000 DCLXIV".
              10 FILLER PIC X(19) VALUE "0665000 DCLXV".
              10 FILLER PIC X(19) VALUE "0666000 DCLXVI".
              10 FILLER PIC X(19) VALUE "0667000 DCLXVII".
              10 FILLER PIC X(19) VALUE "0668000 DCLXVIII".
              10 FILLER PIC X(19) VALUE "0669000 DCLXIX".
              10 FILLER PIC X(19) VALUE "0670000 DCLXX".
              10 FILLER PIC X(19) VALUE "0671000 DCLXXI".
              10 FILLER PIC X(19) VALUE "0672000 DCLXXII".
              10 FILLER PIC X(19) VALUE "0673000 DCLXXIII".
              10 FILLER PIC X(19) VALUE "0674000 DCLXXIV".
              10 FILLER PIC X(19) VALUE "0675000 DCLXXV".
              10 FILLER PIC X(19) VALUE "0676000 DCLXXVI".
              10 FILLER PIC X(19) VALUE "0677000 DCLXXVII".
              10 FILLER PIC X(19) VALUE "0678000 DCLXXVIII".
              10 FILLER PIC X(19) VALUE "0679000 DCLXXIX".
              10 FILLER PIC X(19) VALUE "0680000 DCLXXX".
              10 FILLER PIC X(19) VALUE "0681000 DCLXXXI".
              10 FILLER PIC X(19) VALUE "0682000 DCLXXXII".
              10 FILLER PIC X(19) VALUE "0683000 DCLXXXIII".
              10 FILLER PIC X(19) VALUE "0684000 DCLXXXIV".
              10 FILLER PIC X(19) VALUE "0685000 DCLXXXV".
              10 FILLER PIC X(19) VALUE "0686000 DCLXXXVI".
              10 FILLER PIC X(19) VALUE "0687000 DCLXXXVII".
              10 FILLER PIC X(19) VALUE "0688000 DCLXXXVIII".
              10 FILLER PIC X(19) VALUE "0689000 DCLXXXIX".
              10 FILLER PIC X(19) VALUE "0690000 DCXC".
              10 FILLER PIC X(19) VALUE "0691000 DCXCI".
              10 FILLER PIC X(19) VALUE "0692000 DCXCII".
              10 FILLER PIC X(19) VALUE "0693000 DCXCIII".
              10 FILLER PIC X(19) VALUE "0694000 DCXCIV".
              10 FILLER PIC X(19) VALUE "0695000 DCXCV".
              10 FILLER PIC X(19) VALUE "0696000 DCXCVI".
              10 FILLER PIC X(19) VALUE "0697000 DCXCVII".
              10 FILLER PIC X(19) VALUE "0698000 DCXCVIII".
              10 FILLER PIC X(19) VALUE "0699000 DCXCIX".
              10 FILLER PIC X(19) VALUE "0700000 DCC".
              10 FILLER PIC X(19) VALUE "0701000 DCCI".
              10 FILLER PIC X(19) VALUE "0702000 DCCII".
              10 FILLER PIC X(19) VALUE "0703000 DCCIII".
              10 FILLER PIC X(19) VALUE "0704000 DCCIV".
              10 FILLER PIC X(19) VALUE "0705000 DCCV".
              10 FILLER PIC X(19) VALUE "0706000 DCCVI".
              10 FILLER PIC X(19) VALUE "0707000 DCCVII".
              10 FILLER PIC X(19) VALUE "0708000 DCCVIII".
              10 FILLER PIC X(19) VALUE "0709000 DCCIX".
              10 FILLER PIC X(19) VALUE "0710000 DCCX".
              10 FILLER PIC X(19) VALUE "0711000 DCCXI".
              10 FILLER PIC X(19) VALUE "0712000 DCCXII".
              10 FILLER PIC X(19) VALUE "0713000 DCCXIII".
              10 FILLER PIC X(19) VALUE "0714000 DCCXIV".
              10 FILLER PIC X(19) VALUE "0715000 DCCXV".
              10 FILLER PIC X(19) VALUE "0716000 DCCXVI".
              10 FILLER PIC X(19) VALUE "0717000 DCCXVII".
              10 FILLER PIC X(19) VALUE "0718000 DCCXVIII".
              10 FILLER PIC X(19) VALUE "0719000 DCCXIX".
              10 FILLER PIC X(19) VALUE "0720000 DCCXX".
              10 FILLER PIC X(19) VALUE "0721000 DCCXXI".
              10 FILLER PIC X(19) VALUE "0722000 DCCXXII".
              10 FILLER PIC X(19) VALUE "0723000 DCCXXIII".
              10 FILLER PIC X(19) VALUE "0724000 DCCXXIV".
              10 FILLER PIC X(19) VALUE "0725000 DCCXXV".
              10 FILLER PIC X(19) VALUE "0726000 DCCXXVI".
              10 FILLER PIC X(19) VALUE "0727000 DCCXXVII".
              10 FILLER PIC X(19) VALUE "0728000 DCCXXVIII".
              10 FILLER PIC X(19) VALUE "0729000 DCCXXIX".
              10 FILLER PIC X(19) VALUE "0730000 DCCXXX".
              10 FILLER PIC X(19) VALUE "0731000 DCCXXXI".
              10 FILLER PIC X(19) VALUE "0732000 DCCXXXII".
              10 FILLER PIC X(19) VALUE "0733000 DCCXXXIII".
              10 FILLER PIC X(19) VALUE "0734000 DCCXXXIV".
              10 FILLER PIC X(19) VALUE "0735000 DCCXXXV".
              10 FILLER PIC X(19) VALUE "0736000 DCCXXXVI".
              10 FILLER PIC X(19) VALUE "0737000 DCCXXXVII".
              10 FILLER PIC X(19) VALUE "0738000 DCCXXXVIII".
              10 FILLER PIC X(19) VALUE "0739000 DCCXXXIX".
              10 FILLER PIC X(19) VALUE "0740000 DCCXL".
              10 FILLER PIC X(19) VALUE "0741000 DCCXLI".
              10 FILLER PIC X(19) VALUE "0742000 DCCXLII".
              10 FILLER PIC X(19) VALUE "0743000 DCCXLIII".
              10 FILLER PIC X(19) VALUE "0744000 DCCXLIV".
              10 FILLER PIC X(19) VALUE "0745000 DCCXLV".
              10 FILLER PIC X(19) VALUE "0746000 DCCXLVI".
              10 FILLER PIC X(19) VALUE "0747000 DCCXLVII".
              10 FILLER PIC X(19) VALUE "0748000 DCCXLVIII".
              10 FILLER PIC X(19) VALUE "0749000 DCCXLIX".
              10 FILLER PIC X(19) VALUE "0750000 DCCL".
              10 FILLER PIC X(19) VALUE "0751000 DCCLI".
              10 FILLER PIC X(19) VALUE "0752000 DCCLII".
              10 FILLER PIC X(19) VALUE "0753000 DCCLIII".
              10 FILLER PIC X(19) VALUE "0754000 DCCLIV".
              10 FILLER PIC X(19) VALUE "0755000 DCCLV".
              10 FILLER PIC X(19) VALUE "0756000 DCCLVI".
              10 FILLER PIC X(19) VALUE "0757000 DCCLVII".
              10 FILLER PIC X(19) VALUE "0758000 DCCLVIII".
              10 FILLER PIC X(19) VALUE "0759000 DCCLIX".
              10 FILLER PIC X(19) VALUE "0760000 DCCLX".
              10 FILLER PIC X(19) VALUE "0761000 DCCLXI".
              10 FILLER PIC X(19) VALUE "0762000 DCCLXII".
              10 FILLER PIC X(19) VALUE "0763000 DCCLXIII".
              10 FILLER PIC X(19) VALUE "0764000 DCCLXIV".
              10 FILLER PIC X(19) VALUE "0765000 DCCLXV".
              10 FILLER PIC X(19) VALUE "0766000 DCCLXVI".
              10 FILLER PIC X(19) VALUE "0767000 DCCLXVII".
              10 FILLER PIC X(19) VALUE "0768000 DCCLXVIII".
              10 FILLER PIC X(19) VALUE "0769000 DCCLXIX".
              10 FILLER PIC X(19) VALUE "0770000 DCCLXX".
              10 FILLER PIC X(19) VALUE "0771000 DCCLXXI".
              10 FILLER PIC X(19) VALUE "0772000 DCCLXXII".
              10 FILLER PIC X(19) VALUE "0773000 DCCLXXIII".
              10 FILLER PIC X(19) VALUE "0774000 DCCLXXIV".
              10 FILLER PIC X(19) VALUE "0775000 DCCLXXV".
              10 FILLER PIC X(19) VALUE "0776000 DCCLXXVI".
              10 FILLER PIC X(19) VALUE "0777000 DCCLXXVII".
              10 FILLER PIC X(19) VALUE "0778000 DCCLXXVIII".
              10 FILLER PIC X(19) VALUE "0779000 DCCLXXIX".
              10 FILLER PIC X(19) VALUE "0780000 DCCLXXX".
              10 FILLER PIC X(19) VALUE "0781000 DCCLXXXI".
              10 FILLER PIC X(19) VALUE "0782000 DCCLXXXII".
              10 FILLER PIC X(19) VALUE "0783000 DCCLXXXIII".
              10 FILLER PIC X(19) VALUE "0784000 DCCLXXXIV".
              10 FILLER PIC X(19) VALUE "0785000 DCCLXXXV".
              10 FILLER PIC X(19) VALUE "0786000 DCCLXXXVI".
              10 FILLER PIC X(19) VALUE "0787000 DCCLXXXVII".
              10 FILLER PIC X(19) VALUE "0788000 DCCLXXXVIII".
              10 FILLER PIC X(19) VALUE "0789000 DCCLXXXIX".
              10 FILLER PIC X(19) VALUE "0790000 DCCXC".
              10 FILLER PIC X(19) VALUE "0791000 DCCXCI".
              10 FILLER PIC X(19) VALUE "0792000 DCCXCII".
              10 FILLER PIC X(19) VALUE "0793000 DCCXCIII".
              10 FILLER PIC X(19) VALUE "0794000 DCCXCIV".
              10 FILLER PIC X(19) VALUE "0795000 DCCXCV".
              10 FILLER PIC X(19) VALUE "0796000 DCCXCVI".
              10 FILLER PIC X(19) VALUE "0797000 DCCXCVII".
              10 FILLER PIC X(19) VALUE "0798000 DCCXCVIII".
              10 FILLER PIC X(19) VALUE "0799000 DCCXCIX".
              10 FILLER PIC X(19) VALUE "0800000 DCCC".
              10 FILLER PIC X(19) VALUE "0801000 DCCCI".
              10 FILLER PIC X(19) VALUE "0802000 DCCCII".
              10 FILLER PIC X(19) VALUE "0803000 DCCCIII".
              10 FILLER PIC X(19) VALUE "0804000 DCCCIV".
              10 FILLER PIC X(19) VALUE "0805000 DCCCV".
              10 FILLER PIC X(19) VALUE "0806000 DCCCVI".
              10 FILLER PIC X(19) VALUE "0807000 DCCCVII".
              10 FILLER PIC X(19) VALUE "0808000 DCCCVIII".
              10 FILLER PIC X(19) VALUE "0809000 DCCCIX".
              10 FILLER PIC X(19) VALUE "0810000 DCCCX".
              10 FILLER PIC X(19) VALUE "0811000 DCCCXI".
              10 FILLER PIC X(19) VALUE "0812000 DCCCXII".
              10 FILLER PIC X(19) VALUE "0813000 DCCCXIII".
              10 FILLER PIC X(19) VALUE "0814000 DCCCXIV".
              10 FILLER PIC X(19) VALUE "0815000 DCCCXV".
              10 FILLER PIC X(19) VALUE "0816000 DCCCXVI".
              10 FILLER PIC X(19) VALUE "0817000 DCCCXVII".
              10 FILLER PIC X(19) VALUE "0818000 DCCCXVIII".
              10 FILLER PIC X(19) VALUE "0819000 DCCCXIX".
              10 FILLER PIC X(19) VALUE "0820000 DCCCXX".
              10 FILLER PIC X(19) VALUE "0821000 DCCCXXI".
              10 FILLER PIC X(19) VALUE "0822000 DCCCXXII".
              10 FILLER PIC X(19) VALUE "0823000 DCCCXXIII".
              10 FILLER PIC X(19) VALUE "0824000 DCCCXXIV".
              10 FILLER PIC X(19) VALUE "0825000 DCCCXXV".
              10 FILLER PIC X(19) VALUE "0826000 DCCCXXVI".
              10 FILLER PIC X(19) VALUE "0827000 DCCCXXVII".
              10 FILLER PIC X(19) VALUE "0828000 DCCCXXVIII".
              10 FILLER PIC X(19) VALUE "0829000 DCCCXXIX".
              10 FILLER PIC X(19) VALUE "0830000 DCCCXXX".
              10 FILLER PIC X(19) VALUE "0831000 DCCCXXXI".
              10 FILLER PIC X(19) VALUE "0832000 DCCCXXXII".
              10 FILLER PIC X(19) VALUE "0833000 DCCCXXXIII".
              10 FILLER PIC X(19) VALUE "0834000 DCCCXXXIV".
              10 FILLER PIC X(19) VALUE "0835000 DCCCXXXV".
              10 FILLER PIC X(19) VALUE "0836000 DCCCXXXVI".
              10 FILLER PIC X(19) VALUE "0837000 DCCCXXXVII".
              10 FILLER PIC X(19) VALUE "0838000 DCCCXXXVIII".
              10 FILLER PIC X(19) VALUE "0839000 DCCCXXXIX".
              10 FILLER PIC X(19) VALUE "0840000 DCCCXL".
              10 FILLER PIC X(19) VALUE "0841000 DCCCXLI".
              10 FILLER PIC X(19) VALUE "0842000 DCCCXLII".
              10 FILLER PIC X(19) VALUE "0843000 DCCCXLIII".
              10 FILLER PIC X(19) VALUE "0844000 DCCCXLIV".
              10 FILLER PIC X(19) VALUE "0845000 DCCCXLV".
              10 FILLER PIC X(19) VALUE "0846000 DCCCXLVI".
              10 FILLER PIC X(19) VALUE "0847000 DCCCXLVII".
              10 FILLER PIC X(19) VALUE "0848000 DCCCXLVIII".
              10 FILLER PIC X(19) VALUE "0849000 DCCCXLIX".
              10 FILLER PIC X(19) VALUE "0850000 DCCCL".
              10 FILLER PIC X(19) VALUE "0851000 DCCCLI".
              10 FILLER PIC X(19) VALUE "0852000 DCCCLII".
              10 FILLER PIC X(19) VALUE "0853000 DCCCLIII".
              10 FILLER PIC X(19) VALUE "0854000 DCCCLIV".
              10 FILLER PIC X(19) VALUE "0855000 DCCCLV".
              10 FILLER PIC X(19) VALUE "0856000 DCCCLVI".
              10 FILLER PIC X(19) VALUE "0857000 DCCCLVII".
              10 FILLER PIC X(19) VALUE "0858000 DCCCLVIII".
              10 FILLER PIC X(19) VALUE "0859000 DCCCLIX".
              10 FILLER PIC X(19) VALUE "0860000 DCCCLX".
              10 FILLER PIC X(19) VALUE "0861000 DCCCLXI".
              10 FILLER PIC X(19) VALUE "0862000 DCCCLXII".
              10 FILLER PIC X(19) VALUE "0863000 DCCCLXIII".
              10 FILLER PIC X(19) VALUE "0864000 DCCCLXIV".
              10 FILLER PIC X(19) VALUE "0865000 DCCCLXV".
              10 FILLER PIC X(19) VALUE "0866000 DCCCLXVI".
              10 FILLER PIC X(19) VALUE "0867000 DCCCLXVII".
              10 FILLER PIC X(19) VALUE "0868000 DCCCLXVIII".
              10 FILLER PIC X(19) VALUE "0869000 DCCCLXIX".
              10 FILLER PIC X(19) VALUE "0870000 DCCCLXX".
              10 FILLER PIC X(19) VALUE "0871000 DCCCLXXI".
              10 FILLER PIC X(19) VALUE "0872000 DCCCLXXII".
              10 FILLER PIC X(19) VALUE "0873000 DCCCLXXIII".
              10 FILLER PIC X(19) VALUE "0874000 DCCCLXXIV".
              10 FILLER PIC X(19) VALUE "0875000 DCCCLXXV".
              10 FILLER PIC X(19) VALUE "0876000 DCCCLXXVI".
              10 FILLER PIC X(19) VALUE "0877000 DCCCLXXVII".
              10 FILLER PIC X(19) VALUE "0878000 DCCCLXXVIII".
              10 FILLER PIC X(19) VALUE "0879000 DCCCLXXIX".
              10 FILLER PIC X(19) VALUE "0880000 DCCCLXXX".
              10 FILLER PIC X(19) VALUE "0881000 DCCCLXXXI".
              10 FILLER PIC X(19) VALUE "0882000 DCCCLXXXII".
              10 FILLER PIC X(19) VALUE "0883000 DCCCLXXXIII".
              10 FILLER PIC X(19) VALUE "0884000 DCCCLXXXIV".
              10 FILLER PIC X(19) VALUE "0885000 DCCCLXXXV".
              10 FILLER PIC X(19) VALUE "0886000 DCCCLXXXVI".
              10 FILLER PIC X(19) VALUE "0887000 DCCCLXXXVII".
              10 FILLER PIC X(19) VALUE "0888000 DCCCLXXXVIII".
              10 FILLER PIC X(19) VALUE "0889000 DCCCLXXXIX".
              10 FILLER PIC X(19) VALUE "0890000 DCCCXC".
              10 FILLER PIC X(19) VALUE "0891000 DCCCXCI".
              10 FILLER PIC X(19) VALUE "0892000 DCCCXCII".
              10 FILLER PIC X(19) VALUE "0893000 DCCCXCIII".
              10 FILLER PIC X(19) VALUE "0894000 DCCCXCIV".
              10 FILLER PIC X(19) VALUE "0895000 DCCCXCV".
              10 FILLER PIC X(19) VALUE "0896000 DCCCXCVI".
              10 FILLER PIC X(19) VALUE "0897000 DCCCXCVII".
              10 FILLER PIC X(19) VALUE "0898000 DCCCXCVIII".
              10 FILLER PIC X(19) VALUE "0899000 DCCCXCIX".
              10 FILLER PIC X(19) VALUE "0900000 CM".
              10 FILLER PIC X(19) VALUE "0901000 CMI".
              10 FILLER PIC X(19) VALUE "0902000 CMII".
              10 FILLER PIC X(19) VALUE "0903000 CMIII".
              10 FILLER PIC X(19) VALUE "0904000 CMIV".
              10 FILLER PIC X(19) VALUE "0905000 CMV".
              10 FILLER PIC X(19) VALUE "0906000 CMVI".
              10 FILLER PIC X(19) VALUE "0907000 CMVII".
              10 FILLER PIC X(19) VALUE "0908000 CMVIII".
              10 FILLER PIC X(19) VALUE "0909000 CMIX".
              10 FILLER PIC X(19) VALUE "0910000 CMX".
              10 FILLER PIC X(19) VALUE "0911000 CMXI".
              10 FILLER PIC X(19) VALUE "0912000 CMXII".
              10 FILLER PIC X(19) VALUE "0913000 CMXIII".
              10 FILLER PIC X(19) VALUE "0914000 CMXIV".
              10 FILLER PIC X(19) VALUE "0915000 CMXV".
              10 FILLER PIC X(19) VALUE "0916000 CMXVI".
              10 FILLER PIC X(19) VALUE "0917000 CMXVII".
              10 FILLER PIC X(19) VALUE "0918000 CMXVIII".
              10 FILLER PIC X(19) VALUE "0919000 CMXIX".
              10 FILLER PIC X(19) VALUE "0920000 CMXX".
              10 FILLER PIC X(19) VALUE "0921000 CMXXI".
              10 FILLER PIC X(19) VALUE "0922000 CMXXII".
              10 FILLER PIC X(19) VALUE "0923000 CMXXIII".
              10 FILLER PIC X(19) VALUE "0924000 CMXXIV".
              10 FILLER PIC X(19) VALUE "0925000 CMXXV".
              10 FILLER PIC X(19) VALUE "0926000 CMXXVI".
              10 FILLER PIC X(19) VALUE "0927000 CMXXVII".
              10 FILLER PIC X(19) VALUE "0928000 CMXXVIII".
              10 FILLER PIC X(19) VALUE "0929000 CMXXIX".
              10 FILLER PIC X(19) VALUE "0930000 CMXXX".
              10 FILLER PIC X(19) VALUE "0931000 CMXXXI".
              10 FILLER PIC X(19) VALUE "0932000 CMXXXII".
              10 FILLER PIC X(19) VALUE "0933000 CMXXXIII".
              10 FILLER PIC X(19) VALUE "0934000 CMXXXIV".
              10 FILLER PIC X(19) VALUE "0935000 CMXXXV".
              10 FILLER PIC X(19) VALUE "0936000 CMXXXVI".
              10 FILLER PIC X(19) VALUE "0937000 CMXXXVII".
              10 FILLER PIC X(19) VALUE "0938000 CMXXXVIII".
              10 FILLER PIC X(19) VALUE "0939000 CMXXXIX".
              10 FILLER PIC X(19) VALUE "0940000 CMXL".
              10 FILLER PIC X(19) VALUE "0941000 CMXLI".
              10 FILLER PIC X(19) VALUE "0942000 CMXLII".
              10 FILLER PIC X(19) VALUE "0943000 CMXLIII".
              10 FILLER PIC X(19) VALUE "0944000 CMXLIV".
              10 FILLER PIC X(19) VALUE "0945000 CMXLV".
              10 FILLER PIC X(19) VALUE "0946000 CMXLVI".
              10 FILLER PIC X(19) VALUE "0947000 CMXLVII".
              10 FILLER PIC X(19) VALUE "0948000 CMXLVIII".
              10 FILLER PIC X(19) VALUE "0949000 CMXLIX".
              10 FILLER PIC X(19) VALUE "0950000 CML".
              10 FILLER PIC X(19) VALUE "0951000 CMLI".
              10 FILLER PIC X(19) VALUE "0952000 CMLII".
              10 FILLER PIC X(19) VALUE "0953000 CMLIII".
              10 FILLER PIC X(19) VALUE "0954000 CMLIV".
              10 FILLER PIC X(19) VALUE "0955000 CMLV".
              10 FILLER PIC X(19) VALUE "0956000 CMLVI".
              10 FILLER PIC X(19) VALUE "0957000 CMLVII".
              10 FILLER PIC X(19) VALUE "0958000 CMLVIII".
              10 FILLER PIC X(19) VALUE "0959000 CMLIX".
              10 FILLER PIC X(19) VALUE "0960000 CMLX".
              10 FILLER PIC X(19) VALUE "0961000 CMLXI".
              10 FILLER PIC X(19) VALUE "0962000 CMLXII".
              10 FILLER PIC X(19) VALUE "0963000 CMLXIII".
              10 FILLER PIC X(19) VALUE "0964000 CMLXIV".
              10 FILLER PIC X(19) VALUE "0965000 CMLXV".
              10 FILLER PIC X(19) VALUE "0966000 CMLXVI".
              10 FILLER PIC X(19) VALUE "0967000 CMLXVII".
              10 FILLER PIC X(19) VALUE "0968000 CMLXVIII".
              10 FILLER PIC X(19) VALUE "0969000 CMLXIX".
              10 FILLER PIC X(19) VALUE "0970000 CMLXX".
              10 FILLER PIC X(19) VALUE "0971000 CMLXXI".
              10 FILLER PIC X(19) VALUE "0972000 CMLXXII".
              10 FILLER PIC X(19) VALUE "0973000 CMLXXIII".
              10 FILLER PIC X(19) VALUE "0974000 CMLXXIV".
              10 FILLER PIC X(19) VALUE "0975000 CMLXXV".
              10 FILLER PIC X(19) VALUE "0976000 CMLXXVI".
              10 FILLER PIC X(19) VALUE "0977000 CMLXXVII".
              10 FILLER PIC X(19) VALUE "0978000 CMLXXVIII".
              10 FILLER PIC X(19) VALUE "0979000 CMLXXIX".
              10 FILLER PIC X(19) VALUE "0980000 CMLXXX".
              10 FILLER PIC X(19) VALUE "0981000 CMLXXXI".
              10 FILLER PIC X(19) VALUE "0982000 CMLXXXII".
              10 FILLER PIC X(19) VALUE "0983000 CMLXXXIII".
              10 FILLER PIC X(19) VALUE "0984000 CMLXXXIV".
              10 FILLER PIC X(19) VALUE "0985000 CMLXXXV".
              10 FILLER PIC X(19) VALUE "0986000 CMLXXXVI".
              10 FILLER PIC X(19) VALUE "0987000 CMLXXXVII".
              10 FILLER PIC X(19) VALUE "0988000 CMLXXXVIII".
              10 FILLER PIC X(19) VALUE "0989000 CMLXXXIX".
              10 FILLER PIC X(19) VALUE "0990000 CMXC".
              10 FILLER PIC X(19) VALUE "0991000 CMXCI".
              10 FILLER PIC X(19) VALUE "0992000 CMXCII".
              10 FILLER PIC X(19) VALUE "0993000 CMXCIII".
              10 FILLER PIC X(19) VALUE "0994000 CMXCIV".
              10 FILLER PIC X(19) VALUE "0995000 CMXCV".
              10 FILLER PIC X(19) VALUE "0996000 CMXCVI".
              10 FILLER PIC X(19) VALUE "0997000 CMXCVII".
              10 FILLER PIC X(19) VALUE "0998000 CMXCVIII".
              10 FILLER PIC X(19) VALUE "0999000 CMXCIX".
              10 FILLER PIC X(19) VALUE "1000000 M".
                 
           05 WS-OCCURS-RED REDEFINES WS-OCCURS 
                    OCCURS 1027 TIMES 
                    ASCENDING KEY IS WS-CAR-ARABIC 
                    INDEXED BY WS-TAB-INDEX.
              10  WS-CAR-ARABIC     PIC 9(07).
              10  FILLER            PIC X(01).
              10  WS-CAR-ROMAN      PIC X(11).
           
       PROCEDURE DIVISION.
       
      *******************************************************
      * PROGRAMME PRINCIPAL
      *******************************************************
       0000-MAIN-DEBUT.
           
      *     DISPLAY "DEBUT DE PROGRAMME."
      *
      ****** TRAITEMENT DE LA REPONSE POUR CONTINUER
           PERFORM UNTIL FUNCTION UPPER-CASE (WS-REPONSE) = "N"
              MOVE SPACES TO WS-ACCEPTE
              DISPLAY "ENTREZ UN NBRE nnnnnnn :" NO ADVANCING
              ACCEPT WS-ACCEPTE
      *
      ****** TRAITEMENT DU CHIFFRE SAISI
              IF FUNCTION NUMVAL (WS-ACCEPTE) IS NUMERIC
                  MOVE FUNCTION NUMVAL (WS-ACCEPTE) TO WS-NBR-ARABIC            
                  IF WS-NBR-ARABIC = ZEROES
                      DISPLAY "LE CHIFFRE EST INCORRECT (nnnnnnn)!"
                  ELSE
                      PERFORM 7000-TRAIT-ARABIC-ROMAN-DEBUT 
                         THRU 7000-TRAIT-ARABIC-ROMAN-FIN
                  END-IF
              END-IF
              MOVE SPACES TO WS-REPONSE
      *
      ****** CONTINUER LA SAISIE Y/N
             PERFORM UNTIL FUNCTION UPPER-CASE (WS-REPONSE) = "Y" OR "N"
                 DISPLAY "VOULEZ-VOUS CONTINUER? (Y/N)" NO ADVANCING
                 ACCEPT WS-REPONSE
                 IF NOT (WS-REPONSE-Y OR WS-REPONSE-N)
                    DISPLAY "LA REPONSE DOIR ETRE 'Y' OU 'N'"
                 END-IF
              END-PERFORM
           END-PERFORM.

      *     DISPLAY "FIN DE PROGRAMME".

       0000-MAIN-FIN.

           STOP RUN.

      ******************************************************************
      * TRAITEMENT DU CHIFFRE ARABE EN ROMAIN
      ******************************************************************
       7000-TRAIT-ARABIC-ROMAN-DEBUT.
           
      *     DISPLAY "7000-TRAIT-ARABIC-ROMAN-DEBUT".

           MOVE "N"           TO WS-BOUCLE.
           MOVE SPACES        TO WS-INTER-ROMAN.
           MOVE SPACES        TO WS-NBR-ROMAN.
           MOVE WS-NBR-ARABIC TO WS-CALC-ARABIC.
           MOVE WS-NBR-ARABIC TO WS-INTER-ARABIC.
      *
      ****** BOUCLE DE LECTURE DE CHAQUE COLONNE DU CHIFFRE ARABE SAISI
      ****** D'ABORD LA COLONNE DES MILLIONS, PUIS CELLE DES CENTAINES 
      ****** DE MILIERS, DES DIZAINES DE MILLIERS, DES MILLIERS, DES
      ****** CENTAINES, DES DIZAINES ET ENFIN DES UNITES
           PERFORM VARYING I FROM 1 BY 1 UNTIL WS-BOUCLE-EOF
                 PERFORM UNTIL WS-CALC-ARABIC (I:1) = ZEROES OR SPACES
      ****** CHARGEMENT DANS LA COLONNE CORRESPONDANTE
                    MOVE WS-NBR-ROMAN TO WS-INTER-ROMAN
                    MOVE SPACES       TO WS-NBR-ROMAN
                    MOVE ZEROES               TO WS-INTER-ARABIC
                    MOVE WS-CALC-ARABIC (I:1) TO WS-INTER-ARABIC (I:1)
      *
      ****** RECHERCHE DANS LA TABLE
      *              SET WS-TAB-INDEX TO 1
                    SEARCH ALL WS-OCCURS-RED
                    AT END 
                       DISPLAY "CHIFFRE ARABE NON TROUVE: " 
                                                 WS-INTER-ARABIC
                       MOVE "Y" TO WS-BOUCLE
                    WHEN WS-CAR-ARABIC (WS-TAB-INDEX) = WS-INTER-ARABIC
      *
      ****** CONCATENATION DU CHIFFRE EN COURS AVEC LE NOMBRE PRECEDENT
                       STRING WS-INTER-ROMAN         DELIMITED BY SPACE, 
                         WS-CAR-ROMAN (WS-TAB-INDEX) DELIMITED BY SPACE 
                                                     INTO WS-NBR-ROMAN
      ****** SOUSTRACTION DU CARACTERE ARABE TROUVE AU CHIFFRE ARABE
                       SUBTRACT WS-CAR-ARABIC (WS-TAB-INDEX) 
                                                    FROM WS-CALC-ARABIC
                    END-SEARCH
                 END-PERFORM     
      *
      ****** FIN DE TRAITEMENT DE TOUS LES CHIFFRES? FIN DE BOUCLE
                 IF WS-CALC-ARABIC = ZEROES
                    MOVE "Y" TO WS-BOUCLE
                 END-IF
           END-PERFORM.             
      * 
      ****** AFFICHAGE DU RESULTAT
           
           MOVE SPACES TO WS-AFFICHAGE.

           DISPLAY "--->".           
           STRING "---> LE CHIFFRE ARABE " DELIMITED BY SIZE
                    WS-ACCEPTE     DELIMITED BY SPACE
                    " EST "    DELIMITED BY SIZE
                    WS-NBR-ROMAN   DELIMITED BY SPACE
                 " EN CHIFFRE ROMAIN." DELIMITED BY SIZE
                                   INTO WS-AFFICHAGE.
           DISPLAY WS-AFFICHAGE.
           DISPLAY "--->".
      *     DISPLAY "7000-TRAIT-ARABIC-ROMAN-FIN".

       7000-TRAIT-ARABIC-ROMAN-FIN.
           EXIT.
