       FD  FCLIENT
		     RECORD CONTAINS 77 CHARACTERS
           RECORDING MODE IS F.
  	    01  RCLIENT.
	        03 RCLIENT-ID.
              05 RCLIENT-DEPT PIC X(03).
              05 RCLIENT-MATR PIC X(06).
	        03 RCLIENT-NOM     PIC X(20).
	        03 RCLIENT-PRENOM  PIC X(20).
	        03 RCLIENT-POSTE   PIC X(14).
	        03 RCLIENT-ASSUR   PIC X(08).
	        03 RCLIENT-MONTANT PIC X(06).
			  