       FD  FDEPT
		     RECORD CONTAINS 52 CHARACTERS
           RECORDING MODE IS F.
 	    01  RDEPT.
		     03 RDEPT-ID      PIC X(03).
		     03 RDEPT-DEPT    PIC X(23).
		     03 RDEPT-REGION  PIC X(26).
			  